In [1]:
import pandas as pd
import numpy as np

In [2]:
a={'c1':[1,2,3,4],
  'c2':[444,555,444,666],
  'c3':['xyz','abc','pqr','lmn'],
  'c4':['x','a','p','l'],
  'c5':['s','t','u','v']
  }
df=pd.DataFrame(a)
df

   c1   c2   c3 c4 c5
0   1  444  xyz  x  s
1   2  555  abc  a  t
2   3  444  pqr  p  u
3   4  666  lmn  l  v

In [3]:
unique_values=df['c2'].unique()
unique_values

array([444, 555, 666])

In [4]:
no_of_unique_values=df['c2'].nunique()
no_of_unique_values

3

In [5]:
value_cnt=df['c2'].value_counts()
value_cnt

444    2
555    1
666    1
Name: c2, dtype: int64

In [6]:
df.sort_values('c2')

   c1   c2   c3 c4 c5
0   1  444  xyz  x  s
2   3  444  pqr  p  u
1   2  555  abc  a  t
3   4  666  lmn  l  v

# groupby.count() v/s value_counts()

In [7]:
df.groupby('c2').count()

     c1  c3  c4  c5
c2
444   2   2   2   2
555   1   1   1   1
666   1   1   1   1

In [8]:
df['c2'].value_counts()

444    2
555    1
666    1
Name: c2, dtype: int64

In [9]:
#value_counts : it applies count func on a particular column only
#groupby : it applies count func on all the columns of dataframe

# apply()

In [10]:
a={'c1':[['a','b'],['c','d','e'],['a'],['a','b','c']],
  'c2':['[1,0,0,0,0]','[1,1,0,0,0]','[0,0,0,0,0]','[1,0,1,0,0]'],
  'c3':['xyz','abc','pqr','lmn'],
  }
df=pd.DataFrame(a)

In [11]:
df

          c1           c2   c3
0     [a, b]  [1,0,0,0,0]  xyz
1  [c, d, e]  [1,1,0,0,0]  abc
2        [a]  [0,0,0,0,0]  pqr
3  [a, b, c]  [1,0,1,0,0]  lmn

In [12]:
new_df = df[df['c1'].apply(lambda x:len(x) >1)].reset_index(drop=True)
#new_df = df[df['c1'].apply(len) >1].reset_index(drop=True)   both works
new_df

          c1           c2   c3
0     [a, b]  [1,0,0,0,0]  xyz
1  [c, d, e]  [1,1,0,0,0]  abc
2  [a, b, c]  [1,0,1,0,0]  lmn

In [13]:
df[df['c2'].apply(sum) >2]

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [14]:
df['c2']=df['c2'].apply(eval) #for converting '[1,0,1,0,0]' to [1,0,1,0,0]

In [15]:
df[df['c2'].apply(sum)>1]   # or df[df['c2'].apply(lambda x:sum(x)>1)]

          c1               c2   c3
1  [c, d, e]  [1, 1, 0, 0, 0]  abc
3  [a, b, c]  [1, 0, 1, 0, 0]  lmn